Repository: Citrinate/CS2Interface
Catalog: CS2Interface/Localization/Strings.*.resx
Languages: ru_ru

# ClientAlreadyStarting
source: CS2 Client is already attempting to run, please wait
ru_ru: Клиент CS2 уже пытается запуститься, пожалуйста, подождите

# ClientFatalError
source: CS2 Client experienced a fatal error
ru_ru: Клиент CS2 столкнулся с фатальной ошибкой

# GameDataLoadingFailed
source: Failed to load Game Data
ru_ru: Не удалось загрузить данные игры

# SendingHello
source: Sending hello message
ru_ru: Отправка сообщения приветствия

# GCConnectionFailed
source: CS2 Client wasn't able to connect to GC
ru_ru: Клиент CS2 не смог подключиться к GC

# VerifyingGCConnection
source: Verifying CS2 Client's connection to GC
ru_ru: Проверка подключения клиента CS2 к GC

# MessageRecieved
source: Message Received
ru_ru: Сообщение получено

# InventoryLoaded
source: CS2 inventory loaded
ru_ru: Загрузка инвентаря CS2

# FatalLogonError
source: Fatal CS2 logon error {0}
ru_ru: Фатальная ошибка входа в CS2 {0}

# ClientNotConnectedToGC
source: CS2 Client is not connected to GC
ru_ru: Клиент CS2 не подключен к GC

source: Inspecting item
ru_ru: Осмотр предмета

# RequestTimeout
source: Request timed out
ru_ru: Запрос отложен

source: Invalid Steam ID
ru_ru: Неверный идентификатор Steam

# InspectingPlayer
source: Getting CS2 player profile
ru_ru: Получение профиля игрока CS2

# InventoryNotLoaded
source: Inventory not loaded yet
ru_ru: Инвентарь ещё не загружен

# CasketNotFound
source: Storage unit not found in inventory
ru_ru: Единица хранения не найдена в инвентаре

# CasketContentsUndefined
source: Could not determine storage unit item count
ru_ru: Не удалось определить количество элементов единицы хранения

# OpeningCasket
source: Opening storage unit {0}
ru_ru: Открытие единицы хранения {0}

# CasketContentsLoading
source: Waiting for storage unit {0} items
ru_ru: Ожидание единиц хранения {0} элементов

# CasketItemCountMismatch
source: Storage unit item count mismatch, storage unit should have {0} items but only found {1}
ru_ru: Несоответствие количества элементов в единице хранения, в единице хранения должно быть {0} элементов, но найдено только {1}

# InventoryItemNotFound
source: Item not found in inventory: {0}
ru_ru: Предмет не найден в инвентаре: {0}

# CasketFull
source: Storage unit is full
ru_ru: Единица хранения переполнена

# AddingItemToCasket
source: Adding item {0} to storage unit {1}
ru_ru: Добавление элемента {0} в единицу хранения {1}

# RemovingItemFromCasket
source: Removing item {0} from storage unit {1}
ru_ru: Удаление элемента {0} из единицы хранения {1}

# GameDataLoadingSuccess
source: CS2 game data loaded
ru_ru: Загружены данные игры CS2

# GameDataRefreshing
source: Refreshing CS2 game data
ru_ru: Обновление данных игры CS2

# GameDataSourceFailed
source: Couldn't load game data from: {0}
ru_ru: Не удалось загрузить данные игры из: {0}

# GameDataDefinitionUndefined
source: Couldn't find definition
ru_ru: Не удалось найти определение

# InterfaceAlreadyRunning
source: CS2 Interface is already running
ru_ru: Интерфейс CS2 уже запущен

# InterfaceAlreadyStarting
source: CS2 Interface is already attempting to run
ru_ru: Интерфейс CS2 уже пытается запуститься

# InterfaceStartFailedUnexpectedly
source: CS2 Interface seemed to start, but then didn't
ru_ru: Интерфейс CS2 вроде бы запустился, но потом не запустился

# InterfaceStartFailedRetry
source: CS2 Interface failed to start, retrying
ru_ru: Интерфейс CS2 не удалось запустить, повторная попытка

# InterfaceStartFailed
source: CS2 Interface failed to start
ru_ru: Интерфейс CS2 не удалось запустить

# InterfaceStarted
source: CS2 Interface started
ru_ru: Интерфейс CS2 запущен

# IntefaceNotRunning
source: CS2 Interface was not running
ru_ru: Интерфейс CS2 не был запущен

# InterfaceStopped
source: CS2 Interface stopped
ru_ru: Интерфейс CS2 остановлен

# InterfaceStoppedSuccessfully
source: CS2 Interface successfully stopped
ru_ru: Интерфейс CS2 успешно остановлен

# InterfaceForciblyStopped
source: CS2 Interface was forcibly stopped
ru_ru: Интерфейс CS2 был принудительно остановлен

# InterfaceConnecting
source: CS2 Interface is connecting
ru_ru: Интерфейс CS2 подключается

# InterfaceNotConnected
source: CS2 Interface is not connected
ru_ru: Интерфейс CS2 не подключён

# InterfaceBusy
source: CS2 Interface is busy
ru_ru: Интерфейс CS2 занят

source: Ready
ru_ru: Готов

# InterfaceStoppedUnexpectedly
source: CS2 Interface stopped unexpectedly
ru_ru: Интерфейс CS2 неожиданно остановлен

# InterfaceConnected
source: CS2 Interface is connected
ru_ru: Интерфейс CS2 подключён

# NoBotsAvailable
source: No bots are available
ru_ru: Боты недоступны

# ItemOrigin0
source: Timed Drop
ru_ru: Выпадение по времени

# ItemOrigin1
source: Achievement
ru_ru: Достижение

# ItemOrigin2
source: Purchased
ru_ru: Приобретено

# ItemOrigin3
source: Traded
ru_ru: Обменено

# ItemOrigin4
source: Crafted
ru_ru: Создано

# ItemOrigin5
source: Store Promotion
ru_ru: Продвижение магазина

# ItemOrigin6
source: Gifted
ru_ru: Подарено

# ItemOrigin7
source: Support Granted
ru_ru: Оказана поддержка

# ItemOrigin8
source: Found in Crate
ru_ru: Найдено в ящике

# ItemOrigin9
source: Earned
ru_ru: Заработано

# ItemOrigin10
source: Third-Party Promotion
ru_ru: Продвижение третьих лиц

# ItemOrigin11
source: Wrapped Gift
ru_ru: Упакованный подарок

# ItemOrigin12
source: Halloween Drop
ru_ru: Хэллоуинское выпадение

# ItemOrigin13
source: Steam Purchase
ru_ru: Покупка через Steam

# ItemOrigin14
source: Foreign Item
ru_ru: Иностранный предмет

# ItemOrigin15
source: CD Key
ru_ru: Ключ CD

# ItemOrigin16
source: Collection Reward
ru_ru: Вознаграждение за коллекцию

# ItemOrigin17
source: Preview Item
ru_ru: Предпросмотр

# ItemOrigin18
source: Steam Workshop Contribution
ru_ru: Вклад в мастерскую Steam

# ItemOrigin19
source: Periodic Score Reward
ru_ru: Периодическое вознаграждение за очки

# ItemOrigin20
source: Recycling
ru_ru: Переработка

# ItemOrigin21
source: Tournament Drop
ru_ru: Выпадение с турнира

# ItemOrigin22
source: Stock Item
ru_ru: На складе

# ItemOrigin23
source: Quest Reward
ru_ru: Награда за выполнение квеста

# ItemOrigin24
source: Level Up Reward
ru_ru: Награда за повышение уровня

# InvalidCraftRecipe
source: No crafting recipe was found for the given inputs
ru_ru: Для заданных исходных данных не найдено ни одного рецепта изготовления

# InventoryItemFoundInCrate
source: Cannot use item that's currently in a storage unit: {0}
ru_ru: Невозможно использовать предмет, который в данный момент находится в хранилище: {0}

# InvalidCraftInput
source: This item cannot be used in crafting recipies: {0}
ru_ru: Этот предмет не может быть использован в рецептах: {0}

# CraftingItem
source: Crafting recipe {0} using items: {1}
ru_ru: Рецепт крафта {0} с использованием предметов: {1}

# InvalidCraftDuplicateInput
source: Same item ID used multiple times as an input: {0}
ru_ru: Один и тот же идентификатор элемента используется несколько раз в качестве входного: {0}

# InvalidCraftTooManyInputs
source: Too many crafting inputs given
ru_ru: Слишком много материалов для изготовления

# ClientVersionFail
source: Failed to determine client version
ru_ru: Не удалось определить версию клиента

# InterfaceStartCancelled
source: CS2 Interface start attempt was cancelled
ru_ru: CS2 Попытка запуска интерфейса была отменена

# AccountInUse
source: CS2 Interface cannot start as the account is currently being used to play a game
ru_ru: Интерфейс CS2 не может запуститься, так как учетная запись в настоящее время используется для игры

# GameNotOwned
source: CS2 Interfcae cannot start as the account does not own Counter-Strike 2
ru_ru: CS2 Interfcae не может запуститься, так как аккаунт не владеет Counter-Strike 2

# InterfaceConnectedWithAutoStop
source: CS2 Interface is connected and will auto-stop in {0} minutes
ru_ru: CS2 Интерфейс подключен и будет автоматически остановлен через {0} минут
